In [2]:
## importing libraries
import pandas as pd
from sqlalchemy import Column, Integer, String, ForeignKey
from sqlalchemy.orm import declarative_base
from sqlalchemy import create_engine
from sqlalchemy.orm import sessionmaker

In [10]:
## initializing database
engine = create_engine('sqlite:///../data/vivino.db', echo=True)

## creating session
Session = sessionmaker(bind=engine)

## checking tables in vivino.db
table_names = engine.table_names()
print(table_names)

2023-08-28 14:38:19,660 INFO sqlalchemy.engine.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2023-08-28 14:38:19,661 INFO sqlalchemy.engine.Engine [raw sql] ()
['countries', 'flavor_groups', 'grapes', 'keywords', 'keywords_wine', 'most_used_grapes_per_country', 'regions', 'toplists', 'vintage_toplists_rankings', 'vintages', 'wineries', 'wines']

C:\Users\muham\AppData\Local\Temp\ipykernel_10300\2010403762.py:8: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  table_names = engine.table_names()

In [23]:
## query countries table using SQL query commands
for table in table_names:
    query = """
    SELECT * FROM {}
    """.format(table)
    print(table)
    df = pd.read_sql_query(query, engine)
    display(df.head())

countries
2023-08-28 15:33:27,605 INFO sqlalchemy.engine.Engine
    SELECT * FROM countries

2023-08-28 15:33:27,606 INFO sqlalchemy.engine.Engine [raw sql] ()

  code        name  regions_count  users_count  wines_count  wineries_count
0   it      Italie            563      4270717       274658           42399
1   fr      France           1306      5973301       422503           67553
2   us  États-Unis            362     12273684       204060           28145
3   es     Espagne            152      2264396       102662           18026
4   pt    Portugal             93      1123535        39847            5834

flavor_groups
2023-08-28 15:33:27,616 INFO sqlalchemy.engine.Engine
    SELECT * FROM flavor_groups

2023-08-28 15:33:27,616 INFO sqlalchemy.engine.Engine [raw sql] ()

        name
0      earth
1        oak
2  red_fruit
3    non_oak
4     spices

grapes
2023-08-28 15:33:27,622 INFO sqlalchemy.engine.Engine
    SELECT * FROM grapes

2023-08-28 15:33:27,623 INFO sqlalchemy.engine.Engine [raw sql] ()

   id                name
0   1        Shiraz/Syrah
1   2  Cabernet Sauvignon
2   5          Chardonnay
3   9              Malbec
4  10              Merlot

keywords
2023-08-28 15:33:27,630 INFO sqlalchemy.engine.Engine
    SELECT * FROM keywords

2023-08-28 15:33:27,630 INFO sqlalchemy.engine.Engine [raw sql] ()

   id            name
0   1  5-spice powder
1   2          acacia
2   3      acai berry
3   4   aleppo pepper
4   5        allspice

keywords_wine
2023-08-28 15:33:27,639 INFO sqlalchemy.engine.Engine
    SELECT * FROM keywords_wine

2023-08-28 15:33:27,639 INFO sqlalchemy.engine.Engine [raw sql] ()

   keyword_id  wine_id group_name keyword_type  count
0         242    82698      earth      primary     73
1         284    82698      earth      primary     46
2         156    82698      earth      primary     28
3          22    82698      earth      primary     23
4         384    82698      earth      primary     21

most_used_grapes_per_country
2023-08-28 15:33:28,334 INFO sqlalchemy.engine.Engine
    SELECT * FROM most_used_grapes_per_country

2023-08-28 15:33:28,335 INFO sqlalchemy.engine.Engine [raw sql] ()

   id country_code  grape_id  wines_count
0   1           it        16       125094
1   2           it         5       604208
2   3           it        10       566719
3   4           fr        14       572334
4   5           fr         5       604208

regions
2023-08-28 15:33:28,347 INFO sqlalchemy.engine.Engine
    SELECT * FROM regions

2023-08-28 15:33:28,348 INFO sqlalchemy.engine.Engine [raw sql] ()

   id             name country_code
0   7  South Australia           au
1  24       California           us
2  25      Napa Valley           us
3  26    Sonoma County           us
4  42         Oakville           us

toplists
2023-08-28 15:33:28,356 INFO sqlalchemy.engine.Engine
    SELECT * FROM toplists

2023-08-28 15:33:28,357 INFO sqlalchemy.engine.Engine [raw sql] ()

      id                                               name country_code
0  20165  Vivino's 2016 Wine Style Awards: Italian Barba...       global
1  20167    Vivino's 2016 Wine Style Awards: Italian Barolo       global
2  20169  Vivino's 2016 Wine Style Awards: Italian Bolgheri       global
3  20173   Vivino's 2017 Wine Style Awards: Italian Amarone       global
4  20177    Vivino's 2017 Wine Style Awards: Italian Barolo       global

vintage_toplists_rankings
2023-08-28 15:33:28,364 INFO sqlalchemy.engine.Engine
    SELECT * FROM vintage_toplists_rankings

2023-08-28 15:33:28,365 INFO sqlalchemy.engine.Engine [raw sql] ()

   id  top_list_id  vintage_id  rank  previous_rank
0   1       201650     1161459     7            7.0
1   2       201850     1161459     3            3.0
2   3       201950     1161459     3            3.0
3   4       202050     1161459     1            1.0
4   5      2019264       93707     2            2.0

vintages
2023-08-28 15:33:28,374 INFO sqlalchemy.engine.Engine
    SELECT * FROM vintages

2023-08-28 15:33:28,374 INFO sqlalchemy.engine.Engine [raw sql] ()

,id,name,wine_id,ratings_average,ratings_count,year,price_euros,price_discounted_from,price_discount_percentage,bottle_volume_ml
0,2036,Mazzei Siepi 2005,1471,4.4,580,2005,168.75,NaN,NaN,750
1,2202,Antinori Tignanello 2005,1652,4.5,1933,2005,750.00,NaN,NaN,1500
2,10343,Casanova di Neri Tenuta Nuova Brunello di Mont...,9712,4.5,611,2001,420.00,NaN,NaN,750
3,10786,Poggio Antico Altero Brunello di Montalcino 2006,10152,4.5,236,2006,121.25,NaN,NaN,750
4,10809,Château Angelus Saint-Émilion Grand Cru (Premi...,10175,4.5,876,2007,726.25,NaN,NaN,750

wineries
2023-08-28 15:33:28,400 INFO sqlalchemy.engine.Engine
    SELECT * FROM wineries

2023-08-28 15:33:28,401 INFO sqlalchemy.engine.Engine [raw sql] ()

     id                        name
0  1213  Vin Santo di Montepulciano
1  1268            St. Henri Shiraz
2  1471                       Siepi
3  1647              Solare Toscana
4  1651  Tenuta Tignanello 'Solaia'

wines
2023-08-28 15:33:28,412 INFO sqlalchemy.engine.Engine
    SELECT * FROM wines

2023-08-28 15:33:28,412 INFO sqlalchemy.engine.Engine [raw sql] ()

,id,name,is_natural,region_id,winery_id,ratings_average,ratings_count,url,acidity,fizziness,intensity,sweetness,tannin,user_structure_count
0,1213,Vin Santo di Montepulciano,0,2693,1574,4.6,773,https://www.seulementproduitsitaliens.be/spec_...,4.492628,NaN,3.992133,4.952543,NaN,0.0
1,1268,St. Henri Shiraz,0,7,1305,4.4,17326,https://www.wijnig.nl/penfolds-st-henri-shiraz...,3.015245,NaN,4.612774,2.092192,3.103089,1309.0
2,1471,Siepi,0,394,1620,4.4,8129,https://www.topwijnen.be/nl/product/wijnen/ita...,3.156144,NaN,3.491866,1.807986,2.985634,755.0
3,1647,Solare Toscana,0,394,4772,4.2,4961,https://www.seulementproduitsitaliens.be/spec_...,3.158376,NaN,3.321616,1.701897,3.038064,485.0
4,1651,Tenuta Tignanello 'Solaia',0,394,1252,4.6,33143,http://www.vivino.com/wines/159347388,3.064164,NaN,3.450713,1.888549,2.970583,2131.0

In [24]:
## query PRAGMA table_info() to get column names and types for each table in table_names
for table in table_names:
    query = """
    PRAGMA table_info({})
    """.format(table)
    print(table)
    df = pd.read_sql_query(query, engine)
    display(df)

countries
2023-08-28 15:35:39,515 INFO sqlalchemy.engine.Engine
    PRAGMA table_info(countries)

2023-08-28 15:35:39,516 INFO sqlalchemy.engine.Engine [raw sql] ()

   cid            name     type  notnull dflt_value  pk
0    0            code  VARCHAR        1       None   1
1    1            name  VARCHAR        0       None   0
2    2   regions_count  INTEGER        0       None   0
3    3     users_count  INTEGER        0       None   0
4    4     wines_count  INTEGER        0       None   0
5    5  wineries_count  INTEGER        0       None   0

flavor_groups
2023-08-28 15:35:39,525 INFO sqlalchemy.engine.Engine
    PRAGMA table_info(flavor_groups)

2023-08-28 15:35:39,526 INFO sqlalchemy.engine.Engine [raw sql] ()

   cid  name     type  notnull dflt_value  pk
0    0  name  VARCHAR        1       None   1

grapes
2023-08-28 15:35:39,534 INFO sqlalchemy.engine.Engine
    PRAGMA table_info(grapes)

2023-08-28 15:35:39,534 INFO sqlalchemy.engine.Engine [raw sql] ()

   cid  name     type  notnull dflt_value  pk
0    0    id  INTEGER        1       None   1
1    1  name  VARCHAR        0       None   0

keywords
2023-08-28 15:35:39,542 INFO sqlalchemy.engine.Engine
    PRAGMA table_info(keywords)

2023-08-28 15:35:39,542 INFO sqlalchemy.engine.Engine [raw sql] ()

   cid  name     type  notnull dflt_value  pk
0    0    id  INTEGER        1       None   1
1    1  name  VARCHAR        0       None   0

keywords_wine
2023-08-28 15:35:39,549 INFO sqlalchemy.engine.Engine
    PRAGMA table_info(keywords_wine)

2023-08-28 15:35:39,550 INFO sqlalchemy.engine.Engine [raw sql] ()

   cid          name     type  notnull dflt_value  pk
0    0    keyword_id  INTEGER        1       None   1
1    1       wine_id  INTEGER        1       None   2
2    2    group_name  VARCHAR        1       None   3
3    3  keyword_type  VARCHAR        0       None   0
4    4         count  INTEGER        0       None   0

most_used_grapes_per_country
2023-08-28 15:35:39,557 INFO sqlalchemy.engine.Engine
    PRAGMA table_info(most_used_grapes_per_country)

2023-08-28 15:35:39,558 INFO sqlalchemy.engine.Engine [raw sql] ()

   cid          name     type  notnull dflt_value  pk
0    0            id  INTEGER        1       None   1
1    1  country_code  VARCHAR        0       None   0
2    2      grape_id  INTEGER        0       None   0
3    3   wines_count  INTEGER        0       None   0

regions
2023-08-28 15:35:39,565 INFO sqlalchemy.engine.Engine
    PRAGMA table_info(regions)

2023-08-28 15:35:39,566 INFO sqlalchemy.engine.Engine [raw sql] ()

   cid          name     type  notnull dflt_value  pk
0    0            id  INTEGER        1       None   1
1    1          name  VARCHAR        0       None   0
2    2  country_code  VARCHAR        0       None   0

toplists
2023-08-28 15:35:39,573 INFO sqlalchemy.engine.Engine
    PRAGMA table_info(toplists)

2023-08-28 15:35:39,573 INFO sqlalchemy.engine.Engine [raw sql] ()

   cid          name          type  notnull dflt_value  pk
0    0            id       INTEGER        1       None   1
1    1          name  VARCHAR(255)        1       None   0
2    2  country_code       VARCHAR        0       None   0

vintage_toplists_rankings
2023-08-28 15:35:39,581 INFO sqlalchemy.engine.Engine
    PRAGMA table_info(vintage_toplists_rankings)

2023-08-28 15:35:39,581 INFO sqlalchemy.engine.Engine [raw sql] ()

   cid           name     type  notnull dflt_value  pk
0    0             id  INTEGER        1       None   1
1    1    top_list_id  INTEGER        0       None   0
2    2     vintage_id  INTEGER        0       None   0
3    3           rank  INTEGER        0       None   0
4    4  previous_rank  INTEGER        0       None   0

vintages
2023-08-28 15:35:39,589 INFO sqlalchemy.engine.Engine
    PRAGMA table_info(vintages)

2023-08-28 15:35:39,590 INFO sqlalchemy.engine.Engine [raw sql] ()

   cid                       name     type  notnull dflt_value  pk
0    0                         id  INTEGER        1       None   1
1    1                       name  VARCHAR        0       None   0
2    2                    wine_id  INTEGER        0       None   0
3    3            ratings_average    FLOAT        0       None   0
4    4              ratings_count  INTEGER        0       None   0
5    5                       year  INTEGER        0       None   0
6    6                price_euros    FLOAT        0       None   0
7    7      price_discounted_from    FLOAT        0       None   0
8    8  price_discount_percentage    FLOAT        0       None   0
9    9           bottle_volume_ml  INTEGER        0       None   0

wineries
2023-08-28 15:35:39,597 INFO sqlalchemy.engine.Engine
    PRAGMA table_info(wineries)

2023-08-28 15:35:39,598 INFO sqlalchemy.engine.Engine [raw sql] ()

   cid  name     type  notnull dflt_value  pk
0    0    id  INTEGER        1       None   1
1    1  name  VARCHAR        0       None   0

wines
2023-08-28 15:35:39,607 INFO sqlalchemy.engine.Engine
    PRAGMA table_info(wines)

2023-08-28 15:35:39,607 INFO sqlalchemy.engine.Engine [raw sql] ()

    cid                  name     type  notnull dflt_value  pk
0     0                    id  INTEGER        1       None   1
1     1                  name  VARCHAR        0       None   0
2     2            is_natural  BOOLEAN        0       None   0
3     3             region_id  INTEGER        0       None   0
4     4             winery_id  INTEGER        0       None   0
5     5       ratings_average    FLOAT        0       None   0
6     6         ratings_count  INTEGER        0       None   0
7     7                   url  VARCHAR        0       None   0
8     8               acidity    FLOAT        0       None   0
9     9             fizziness    FLOAT        0       None   0
10   10             intensity    FLOAT        0       None   0
11   11             sweetness    FLOAT        0       None   0
12   12                tannin    FLOAT        0       None   0
13   13  user_structure_count  INTEGER        0       None   0

### QUESTION 1 - We want to highlight 10 wines to increase our sales. Which ones should we choose and why?

In [33]:
## query wines table to convert region_id and winery_id to its associated name

query_one = """
SELECT wines.id, wines.name, wines.ratings_average, wines.ratings_count,
    regions.id AS region_id, regions.name AS region, 
    wineries.id AS winery_id, wineries.name AS winery
FROM wines
JOIN regions ON wines.region_id = regions.id
JOIN wineries ON wines.winery_id = wineries.id;
"""
wines_df = pd.read_sql_query(query_one, engine)

display(wines_df)



## count number of wines per region
num_wine_region = wines_df['region'].value_counts(ascending=False)
## count number of wines per winery
num_wine_winery = wines_df['winery'].value_counts(ascending=False)

## count the number of mentioned regions and wineries ini wines_df
num_regions = wines_df['region'].nunique()
num_wineries = wines_df['winery'].nunique()

display(num_wine_region, num_wine_winery, num_regions, num_wineries)

2023-08-28 16:18:27,878 INFO sqlalchemy.engine.Engine
SELECT wines.id, wines.name, wines.ratings_average, wines.ratings_count,
    regions.id AS region_id, regions.name AS region,
    wineries.id AS winery_id, wineries.name AS winery
FROM wines
JOIN regions ON wines.region_id = regions.id
JOIN wineries ON wines.winery_id = wineries.id;

2023-08-28 16:18:27,879 INFO sqlalchemy.engine.Engine [raw sql] ()

,id,name,ratings_average,ratings_count,region_id,region,winery_id,winery
0,31124,The Armagh Shiraz,4.5,2472,444,Clare Valley,1651,Tenuta Tignanello 'Solaia'
1,4656452,Colheita Porto,4.4,741,718,Porto,1652,Tignanello
2,4801666,Lion Tamer Napa Valley Red Blend,4.3,4981,25,Napa Valley,1471,Siepi
3,6795398,Raut Lagrein,4.5,58,661,Südtirol - Alto Adige,75712,Corte di Cama Sforzato di Valtellina

region
Clare Valley             1
Porto                    1
Napa Valley              1
Südtirol - Alto Adige    1
Name: count, dtype: int64

winery
Tenuta Tignanello 'Solaia'              1
Tignanello                              1
Siepi                                   1
Corte di Cama Sforzato di Valtellina    1
Name: count, dtype: int64

4

4

In [35]:
%load_ext sql

In [36]:
%%sql

UsageError: %%sql is a cell magic, but the cell body is empty. Did you mean the line magic %sql (single %)?

In [ ]:
## attempt 2
query_two = """
SELECT regions.name AS region, wineries.name AS winery, COUNT(wines.id) AS wine_count
FROM wines
JOIN regions ON wines.region_id = regions.id
JOIN wineries ON wines.winery_id = wineries.id
GROUP BY regions.name, wineries.name;
"""
session.query(query_two).all()
session.